
angular.module('myApp')
.controller('AppCtrl', function ($scope, $timeout,$mdDialog,
	$mdSidenav, $log,$mdToast,$window,
	$anchorScroll,$document,$http,listSubject,
	listDisciplines,listTeachers,schedule) {


	//$scope.tabs1 = schedule.data.value;
  $scope.tabs1 = [
  {
    "Ref_Key": "72189605-6591-11e9-a79f-525400398225",
    "DataVersion": "AAAAMAAAAAA=",
    "DeletionMark": false,
    "Number": "000000090",
    "Date": "2019-04-23T03:55:41",
    "Posted": true,
    "Организация_Key": "db823ef1-eb90-4fd1-b88d-207dd67b9e20",
    "ДатаРасписания": "2019-04-27T00:00:00",
    "Отделение_Key": "00000000-0000-0000-0000-000000000000",
    "ДеньНедели": "Суббота",
    "ВидНедели": "Нечетная",
    "НомерНедели": 17,
    "РасписаниеЗвонков_Key": "f0c7b75a-a488-4d9b-a175-f8374de43184",
    "Ответственный_Key": "00000000-0000-0000-0000-000000000000",
    "Автор_Key": "0d7b6d85-8dad-11e4-2594-525400398225",
    "Комментарий": "",
    "УчебныеГруппы": [
      {
        "Ref_Key": "72189605-6591-11e9-a79f-525400398225",
        "LineNumber": "1",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225"
      }
    ],
    "Расписание": [
      {
        "Ref_Key": "72189605-6591-11e9-a79f-525400398225",
        "LineNumber": "1",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 1,
        "НомерПары": 1,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "39e6ced7-0541-11e6-80c9-5254005a0b53",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "729a1d9e-0fca-11e8-df9d-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Слугин Владимир Георгиевич",
        "Аудитория_Name": "Лаборатория 3D-моделирования и прототипирования",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "72189605-6591-11e9-a79f-525400398225",
        "LineNumber": "2",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 1,
        "НомерПары": 2,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "39e6ced7-0541-11e6-80c9-5254005a0b53",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "729a1d9e-0fca-11e8-df9d-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Слугин Владимир Георгиевич",
        "Аудитория_Name": "Лаборатория 3D-моделирования и прототипирования",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "72189605-6591-11e9-a79f-525400398225",
        "LineNumber": "3",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 1,
        "НомерПары": 3,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "39e6ced7-0541-11e6-80c9-5254005a0b53",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "729a1d9e-0fca-11e8-df9d-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Слугин Владимир Георгиевич",
        "Аудитория_Name": "Лаборатория 3D-моделирования и прототипирования",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "72189605-6591-11e9-a79f-525400398225",
        "LineNumber": "4",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 2,
        "НомерПары": 1,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "84a6578d-4d0b-11e7-3e82-525400398225",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "84a6578f-4d0b-11e7-3e82-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Попцов Артём Вячеславович",
        "Аудитория_Name": "Лаборатория программирования микроконтроллеров и разработки микропроцессорных систем",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "72189605-6591-11e9-a79f-525400398225",
        "LineNumber": "5",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 2,
        "НомерПары": 2,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "84a6578d-4d0b-11e7-3e82-525400398225",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "84a6578f-4d0b-11e7-3e82-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Попцов Артём Вячеславович",
        "Аудитория_Name": "Лаборатория программирования микроконтроллеров и разработки микропроцессорных систем",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "72189605-6591-11e9-a79f-525400398225",
        "LineNumber": "6",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 2,
        "НомерПары": 3,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "84a6578d-4d0b-11e7-3e82-525400398225",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "84a6578f-4d0b-11e7-3e82-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Попцов Артём Вячеславович",
        "Аудитория_Name": "Лаборатория программирования микроконтроллеров и разработки микропроцессорных систем",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      }
    ],
    "Преподаватели": [
      {
        "Ref_Key": "72189605-6591-11e9-a79f-525400398225",
        "LineNumber": "1",
        "Преподаватель_Key": "39e6ced7-0541-11e6-80c9-5254005a0b53"
      },
      {
        "Ref_Key": "72189605-6591-11e9-a79f-525400398225",
        "LineNumber": "2",
        "Преподаватель_Key": "84a6578d-4d0b-11e7-3e82-525400398225"
      }
    ],
    "РасписаниеПреподователя": [],
    "Организация@navigationLinkUrl": "Document_РасписаниеНаДату(guid'72189605-6591-11e9-a79f-525400398225')/Организация",
    "РасписаниеЗвонков@navigationLinkUrl": "Document_РасписаниеНаДату(guid'72189605-6591-11e9-a79f-525400398225')/РасписаниеЗвонков",
    "Автор@navigationLinkUrl": "Document_РасписаниеНаДату(guid'72189605-6591-11e9-a79f-525400398225')/Автор"
  },
  {
    "Ref_Key": "72189604-6591-11e9-a79f-525400398225",
    "DataVersion": "AAAALwAAAAA=",
    "DeletionMark": false,
    "Number": "000000089",
    "Date": "2019-04-23T03:52:49",
    "Posted": true,
    "Организация_Key": "db823ef1-eb90-4fd1-b88d-207dd67b9e20",
    "ДатаРасписания": "2019-04-26T00:00:00",
    "Отделение_Key": "00000000-0000-0000-0000-000000000000",
    "ДеньНедели": "Пятница",
    "ВидНедели": "Нечетная",
    "НомерНедели": 17,
    "РасписаниеЗвонков_Key": "f0c7b75a-a488-4d9b-a175-f8374de43184",
    "Ответственный_Key": "00000000-0000-0000-0000-000000000000",
    "Автор_Key": "0d7b6d85-8dad-11e4-2594-525400398225",
    "Комментарий": "",
    "УчебныеГруппы": [
      {
        "Ref_Key": "72189604-6591-11e9-a79f-525400398225",
        "LineNumber": "1",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225"
      }
    ],
    "Расписание": [
      {
        "Ref_Key": "72189604-6591-11e9-a79f-525400398225",
        "LineNumber": "1",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 1,
        "НомерПары": 1,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "39e6ced7-0541-11e6-80c9-5254005a0b53",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "729a1d9e-0fca-11e8-df9d-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Слугин Владимир Георгиевич",
        "Аудитория_Name": "Лаборатория 3D-моделирования и прототипирования",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "72189604-6591-11e9-a79f-525400398225",
        "LineNumber": "2",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 1,
        "НомерПары": 2,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "39e6ced7-0541-11e6-80c9-5254005a0b53",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "729a1d9e-0fca-11e8-df9d-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Слугин Владимир Георгиевич",
        "Аудитория_Name": "Лаборатория 3D-моделирования и прототипирования",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "72189604-6591-11e9-a79f-525400398225",
        "LineNumber": "3",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 1,
        "НомерПары": 3,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "39e6ced7-0541-11e6-80c9-5254005a0b53",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "729a1d9e-0fca-11e8-df9d-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Слугин Владимир Георгиевич",
        "Аудитория_Name": "Лаборатория 3D-моделирования и прототипирования",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "72189604-6591-11e9-a79f-525400398225",
        "LineNumber": "4",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 2,
        "НомерПары": 1,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "84a6578d-4d0b-11e7-3e82-525400398225",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "84a6578f-4d0b-11e7-3e82-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Попцов Артём Вячеславович",
        "Аудитория_Name": "Лаборатория программирования микроконтроллеров и разработки микропроцессорных систем",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "72189604-6591-11e9-a79f-525400398225",
        "LineNumber": "5",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 2,
        "НомерПары": 2,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "84a6578d-4d0b-11e7-3e82-525400398225",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "84a6578f-4d0b-11e7-3e82-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Попцов Артём Вячеславович",
        "Аудитория_Name": "Лаборатория программирования микроконтроллеров и разработки микропроцессорных систем",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "72189604-6591-11e9-a79f-525400398225",
        "LineNumber": "6",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 2,
        "НомерПары": 3,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "84a6578d-4d0b-11e7-3e82-525400398225",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "84a6578f-4d0b-11e7-3e82-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Попцов Артём Вячеславович",
        "Аудитория_Name": "Лаборатория программирования микроконтроллеров и разработки микропроцессорных систем",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      }
    ],
    "Преподаватели": [
      {
        "Ref_Key": "72189604-6591-11e9-a79f-525400398225",
        "LineNumber": "1",
        "Преподаватель_Key": "39e6ced7-0541-11e6-80c9-5254005a0b53"
      },
      {
        "Ref_Key": "72189604-6591-11e9-a79f-525400398225",
        "LineNumber": "2",
        "Преподаватель_Key": "84a6578d-4d0b-11e7-3e82-525400398225"
      }
    ],
    "РасписаниеПреподователя": [],
    "Организация@navigationLinkUrl": "Document_РасписаниеНаДату(guid'72189604-6591-11e9-a79f-525400398225')/Организация",
    "РасписаниеЗвонков@navigationLinkUrl": "Document_РасписаниеНаДату(guid'72189604-6591-11e9-a79f-525400398225')/РасписаниеЗвонков",
    "Автор@navigationLinkUrl": "Document_РасписаниеНаДату(guid'72189604-6591-11e9-a79f-525400398225')/Автор"
  },
  {
    "Ref_Key": "72189603-6591-11e9-a79f-525400398225",
    "DataVersion": "AAAALgAAAAA=",
    "DeletionMark": false,
    "Number": "000000088",
    "Date": "2019-04-23T03:36:43",
    "Posted": true,
    "Организация_Key": "db823ef1-eb90-4fd1-b88d-207dd67b9e20",
    "ДатаРасписания": "2019-04-25T00:00:00",
    "Отделение_Key": "00000000-0000-0000-0000-000000000000",
    "ДеньНедели": "Четверг",
    "ВидНедели": "Нечетная",
    "НомерНедели": 17,
    "РасписаниеЗвонков_Key": "f0c7b75a-a488-4d9b-a175-f8374de43184",
    "Ответственный_Key": "00000000-0000-0000-0000-000000000000",
    "Автор_Key": "0d7b6d85-8dad-11e4-2594-525400398225",
    "Комментарий": "",
    "УчебныеГруппы": [
      {
        "Ref_Key": "72189603-6591-11e9-a79f-525400398225",
        "LineNumber": "1",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225"
      }
    ],
    "Расписание": [
      {
        "Ref_Key": "72189603-6591-11e9-a79f-525400398225",
        "LineNumber": "1",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 1,
        "НомерПары": 1,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "39e6ced7-0541-11e6-80c9-5254005a0b53",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "729a1d9e-0fca-11e8-df9d-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Слугин Владимир Георгиевич",
        "Аудитория_Name": "Лаборатория 3D-моделирования и прототипирования",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "72189603-6591-11e9-a79f-525400398225",
        "LineNumber": "2",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 1,
        "НомерПары": 2,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "39e6ced7-0541-11e6-80c9-5254005a0b53",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "729a1d9e-0fca-11e8-df9d-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Слугин Владимир Георгиевич",
        "Аудитория_Name": "Лаборатория 3D-моделирования и прототипирования",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "72189603-6591-11e9-a79f-525400398225",
        "LineNumber": "3",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 1,
        "НомерПары": 3,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "39e6ced7-0541-11e6-80c9-5254005a0b53",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "729a1d9e-0fca-11e8-df9d-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Слугин Владимир Георгиевич",
        "Аудитория_Name": "Лаборатория 3D-моделирования и прототипирования",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "72189603-6591-11e9-a79f-525400398225",
        "LineNumber": "4",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 2,
        "НомерПары": 1,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "84a6578d-4d0b-11e7-3e82-525400398225",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "84a6578f-4d0b-11e7-3e82-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Попцов Артём Вячеславович",
        "Аудитория_Name": "Лаборатория программирования микроконтроллеров и разработки микропроцессорных систем",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "72189603-6591-11e9-a79f-525400398225",
        "LineNumber": "5",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 2,
        "НомерПары": 2,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "84a6578d-4d0b-11e7-3e82-525400398225",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "84a6578f-4d0b-11e7-3e82-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Попцов Артём Вячеславович",
        "Аудитория_Name": "Лаборатория программирования микроконтроллеров и разработки микропроцессорных систем",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "72189603-6591-11e9-a79f-525400398225",
        "LineNumber": "6",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 2,
        "НомерПары": 3,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "84a6578d-4d0b-11e7-3e82-525400398225",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "84a6578f-4d0b-11e7-3e82-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Попцов Артём Вячеславович",
        "Аудитория_Name": "Лаборатория программирования микроконтроллеров и разработки микропроцессорных систем",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      }
    ],
    "Преподаватели": [
      {
        "Ref_Key": "72189603-6591-11e9-a79f-525400398225",
        "LineNumber": "1",
        "Преподаватель_Key": "39e6ced7-0541-11e6-80c9-5254005a0b53"
      },
      {
        "Ref_Key": "72189603-6591-11e9-a79f-525400398225",
        "LineNumber": "2",
        "Преподаватель_Key": "84a6578d-4d0b-11e7-3e82-525400398225"
      }
    ],
    "РасписаниеПреподователя": [],
    "Организация@navigationLinkUrl": "Document_РасписаниеНаДату(guid'72189603-6591-11e9-a79f-525400398225')/Организация",
    "РасписаниеЗвонков@navigationLinkUrl": "Document_РасписаниеНаДату(guid'72189603-6591-11e9-a79f-525400398225')/РасписаниеЗвонков",
    "Автор@navigationLinkUrl": "Document_РасписаниеНаДату(guid'72189603-6591-11e9-a79f-525400398225')/Автор"
  },
  {
    "Ref_Key": "72189602-6591-11e9-a79f-525400398225",
    "DataVersion": "AAAALQAAAAA=",
    "DeletionMark": false,
    "Number": "000000087",
    "Date": "2019-04-23T03:35:45",
    "Posted": true,
    "Организация_Key": "db823ef1-eb90-4fd1-b88d-207dd67b9e20",
    "ДатаРасписания": "2019-04-24T00:00:00",
    "Отделение_Key": "00000000-0000-0000-0000-000000000000",
    "ДеньНедели": "Среда",
    "ВидНедели": "Нечетная",
    "НомерНедели": 17,
    "РасписаниеЗвонков_Key": "f0c7b75a-a488-4d9b-a175-f8374de43184",
    "Ответственный_Key": "00000000-0000-0000-0000-000000000000",
    "Автор_Key": "0d7b6d85-8dad-11e4-2594-525400398225",
    "Комментарий": "",
    "УчебныеГруппы": [
      {
        "Ref_Key": "72189602-6591-11e9-a79f-525400398225",
        "LineNumber": "1",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225"
      }
    ],
    "Расписание": [
      {
        "Ref_Key": "72189602-6591-11e9-a79f-525400398225",
        "LineNumber": "1",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 1,
        "НомерПары": 1,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "39e6ced7-0541-11e6-80c9-5254005a0b53",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "729a1d9e-0fca-11e8-df9d-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Слугин Владимир Георгиевич",
        "Аудитория_Name": "Лаборатория 3D-моделирования и прототипирования",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "72189602-6591-11e9-a79f-525400398225",
        "LineNumber": "2",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 1,
        "НомерПары": 2,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "39e6ced7-0541-11e6-80c9-5254005a0b53",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "729a1d9e-0fca-11e8-df9d-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Слугин Владимир Георгиевич",
        "Аудитория_Name": "Лаборатория 3D-моделирования и прототипирования",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "72189602-6591-11e9-a79f-525400398225",
        "LineNumber": "3",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 1,
        "НомерПары": 3,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "39e6ced7-0541-11e6-80c9-5254005a0b53",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "729a1d9e-0fca-11e8-df9d-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Слугин Владимир Георгиевич",
        "Аудитория_Name": "Лаборатория 3D-моделирования и прототипирования",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "72189602-6591-11e9-a79f-525400398225",
        "LineNumber": "4",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 2,
        "НомерПары": 1,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "84a6578d-4d0b-11e7-3e82-525400398225",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "84a6578f-4d0b-11e7-3e82-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Попцов Артём Вячеславович",
        "Аудитория_Name": "Лаборатория программирования микроконтроллеров и разработки микропроцессорных систем",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "72189602-6591-11e9-a79f-525400398225",
        "LineNumber": "5",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 2,
        "НомерПары": 2,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "84a6578d-4d0b-11e7-3e82-525400398225",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "84a6578f-4d0b-11e7-3e82-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Попцов Артём Вячеславович",
        "Аудитория_Name": "Лаборатория программирования микроконтроллеров и разработки микропроцессорных систем",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "72189602-6591-11e9-a79f-525400398225",
        "LineNumber": "6",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 2,
        "НомерПары": 3,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "84a6578d-4d0b-11e7-3e82-525400398225",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "84a6578f-4d0b-11e7-3e82-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Попцов Артём Вячеславович",
        "Аудитория_Name": "Лаборатория программирования микроконтроллеров и разработки микропроцессорных систем",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      }
    ],
    "Преподаватели": [
      {
        "Ref_Key": "72189602-6591-11e9-a79f-525400398225",
        "LineNumber": "1",
        "Преподаватель_Key": "39e6ced7-0541-11e6-80c9-5254005a0b53"
      },
      {
        "Ref_Key": "72189602-6591-11e9-a79f-525400398225",
        "LineNumber": "2",
        "Преподаватель_Key": "84a6578d-4d0b-11e7-3e82-525400398225"
      }
    ],
    "РасписаниеПреподователя": [],
    "Организация@navigationLinkUrl": "Document_РасписаниеНаДату(guid'72189602-6591-11e9-a79f-525400398225')/Организация",
    "РасписаниеЗвонков@navigationLinkUrl": "Document_РасписаниеНаДату(guid'72189602-6591-11e9-a79f-525400398225')/РасписаниеЗвонков",
    "Автор@navigationLinkUrl": "Document_РасписаниеНаДату(guid'72189602-6591-11e9-a79f-525400398225')/Автор"
  },
  {
    "Ref_Key": "721895f9-6591-11e9-a79f-525400398225",
    "DataVersion": "AAAALAAAAAA=",
    "DeletionMark": false,
    "Number": "000000086",
    "Date": "2019-04-23T03:34:15",
    "Posted": true,
    "Организация_Key": "db823ef1-eb90-4fd1-b88d-207dd67b9e20",
    "ДатаРасписания": "2019-04-23T00:00:00",
    "Отделение_Key": "00000000-0000-0000-0000-000000000000",
    "ДеньНедели": "Вторник",
    "ВидНедели": "Нечетная",
    "НомерНедели": 17,
    "РасписаниеЗвонков_Key": "f0c7b75a-a488-4d9b-a175-f8374de43184",
    "Ответственный_Key": "00000000-0000-0000-0000-000000000000",
    "Автор_Key": "0d7b6d85-8dad-11e4-2594-525400398225",
    "Комментарий": "",
    "УчебныеГруппы": [
      {
        "Ref_Key": "721895f9-6591-11e9-a79f-525400398225",
        "LineNumber": "1",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225"
      }
    ],
    "Расписание": [
      {
        "Ref_Key": "721895f9-6591-11e9-a79f-525400398225",
        "LineNumber": "1",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 1,
        "НомерПары": 1,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "39e6ced7-0541-11e6-80c9-5254005a0b53",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "729a1d9e-0fca-11e8-df9d-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Слугин Владимир Георгиевич",
        "Аудитория_Name": "Лаборатория 3D-моделирования и прототипирования",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "721895f9-6591-11e9-a79f-525400398225",
        "LineNumber": "2",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 1,
        "НомерПары": 2,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "39e6ced7-0541-11e6-80c9-5254005a0b53",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "729a1d9e-0fca-11e8-df9d-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Слугин Владимир Георгиевич",
        "Аудитория_Name": "Лаборатория 3D-моделирования и прототипирования",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "721895f9-6591-11e9-a79f-525400398225",
        "LineNumber": "3",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 1,
        "НомерПары": 3,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "39e6ced7-0541-11e6-80c9-5254005a0b53",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "729a1d9e-0fca-11e8-df9d-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Слугин Владимир Георгиевич",
        "Аудитория_Name": "Лаборатория 3D-моделирования и прототипирования",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "721895f9-6591-11e9-a79f-525400398225",
        "LineNumber": "4",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 2,
        "НомерПары": 1,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "84a6578d-4d0b-11e7-3e82-525400398225",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "729a1d9e-0fca-11e8-df9d-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Попцов Артём Вячеславович",
        "Аудитория_Name": "Лаборатория 3D-моделирования и прототипирования",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "721895f9-6591-11e9-a79f-525400398225",
        "LineNumber": "5",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 2,
        "НомерПары": 2,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "84a6578d-4d0b-11e7-3e82-525400398225",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "729a1d9e-0fca-11e8-df9d-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Попцов Артём Вячеславович",
        "Аудитория_Name": "Лаборатория 3D-моделирования и прототипирования",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "721895f9-6591-11e9-a79f-525400398225",
        "LineNumber": "6",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 2,
        "НомерПары": 3,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "84a6578d-4d0b-11e7-3e82-525400398225",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "729a1d9e-0fca-11e8-df9d-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Попцов Артём Вячеславович",
        "Аудитория_Name": "Лаборатория 3D-моделирования и прототипирования",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      }
    ],
    "Преподаватели": [
      {
        "Ref_Key": "721895f9-6591-11e9-a79f-525400398225",
        "LineNumber": "1",
        "Преподаватель_Key": "39e6ced7-0541-11e6-80c9-5254005a0b53"
      },
      {
        "Ref_Key": "721895f9-6591-11e9-a79f-525400398225",
        "LineNumber": "2",
        "Преподаватель_Key": "84a6578d-4d0b-11e7-3e82-525400398225"
      }
    ],
    "РасписаниеПреподователя": [],
    "Организация@navigationLinkUrl": "Document_РасписаниеНаДату(guid'721895f9-6591-11e9-a79f-525400398225')/Организация",
    "РасписаниеЗвонков@navigationLinkUrl": "Document_РасписаниеНаДату(guid'721895f9-6591-11e9-a79f-525400398225')/РасписаниеЗвонков",
    "Автор@navigationLinkUrl": "Document_РасписаниеНаДату(guid'721895f9-6591-11e9-a79f-525400398225')/Автор"
  },
  {
    "Ref_Key": "721895f8-6591-11e9-a79f-525400398225",
    "DataVersion": "AAAAKwAAAAA=",
    "DeletionMark": false,
    "Number": "000000085",
    "Date": "2019-04-22T12:00:00",
    "Posted": true,
    "Организация_Key": "db823ef1-eb90-4fd1-b88d-207dd67b9e20",
    "ДатаРасписания": "2019-04-22T00:00:00",
    "Отделение_Key": "00000000-0000-0000-0000-000000000000",
    "ДеньНедели": "Понедельник",
    "ВидНедели": "Нечетная",
    "НомерНедели": 17,
    "РасписаниеЗвонков_Key": "f0c7b75a-a488-4d9b-a175-f8374de43184",
    "Ответственный_Key": "00000000-0000-0000-0000-000000000000",
    "Автор_Key": "0d7b6d85-8dad-11e4-2594-525400398225",
    "Комментарий": "",
    "УчебныеГруппы": [
      {
        "Ref_Key": "721895f8-6591-11e9-a79f-525400398225",
        "LineNumber": "1",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225"
      }
    ],
    "Расписание": [
      {
        "Ref_Key": "721895f8-6591-11e9-a79f-525400398225",
        "LineNumber": "1",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 1,
        "НомерПары": 1,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "39e6ced7-0541-11e6-80c9-5254005a0b53",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "729a1d9e-0fca-11e8-df9d-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Слугин Владимир Георгиевич",
        "Аудитория_Name": "Лаборатория 3D-моделирования и прототипирования",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "721895f8-6591-11e9-a79f-525400398225",
        "LineNumber": "2",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 1,
        "НомерПары": 2,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "39e6ced7-0541-11e6-80c9-5254005a0b53",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "729a1d9e-0fca-11e8-df9d-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Слугин Владимир Георгиевич",
        "Аудитория_Name": "Лаборатория 3D-моделирования и прототипирования",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "721895f8-6591-11e9-a79f-525400398225",
        "LineNumber": "3",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 1,
        "НомерПары": 3,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "39e6ced7-0541-11e6-80c9-5254005a0b53",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "729a1d9e-0fca-11e8-df9d-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Слугин Владимир Георгиевич",
        "Аудитория_Name": "Лаборатория 3D-моделирования и прототипирования",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "721895f8-6591-11e9-a79f-525400398225",
        "LineNumber": "4",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 2,
        "НомерПары": 1,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "84a6578d-4d0b-11e7-3e82-525400398225",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "84a6578f-4d0b-11e7-3e82-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Попцов Артём Вячеславович",
        "Аудитория_Name": "Лаборатория программирования микроконтроллеров и разработки микропроцессорных систем",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "721895f8-6591-11e9-a79f-525400398225",
        "LineNumber": "5",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 2,
        "НомерПары": 2,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "84a6578d-4d0b-11e7-3e82-525400398225",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "84a6578f-4d0b-11e7-3e82-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Попцов Артём Вячеславович",
        "Аудитория_Name": "Лаборатория программирования микроконтроллеров и разработки микропроцессорных систем",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      },
      {
        "Ref_Key": "721895f8-6591-11e9-a79f-525400398225",
        "LineNumber": "6",
        "УчебнаяГруппа_Key": "d3baf704-2066-11e8-d483-525400398225",
        "Подгруппа": 2,
        "НомерПары": 3,
        "Дисциплина_Key": "721895ee-6591-11e9-a79f-525400398225",
        "Преподаватель_Key": "84a6578d-4d0b-11e7-3e82-525400398225",
        "Территория_Key": "b0683a0e-b547-11e6-80ce-5254005a0b53",
        "Аудитория_Key": "84a6578f-4d0b-11e7-3e82-525400398225",
        "Дисциплина_Name": "по ПМ.01 Разработка программных модулей программного обеспечения для компьютерных сетей",
        "Преподаватель_Name": "Попцов Артём Вячеславович",
        "Аудитория_Name": "Лаборатория программирования микроконтроллеров и разработки микропроцессорных систем",
        "УчебнаяГруппа_Name": "ПКС-17-2с"
      }
    ],
    "Преподаватели": [
      {
        "Ref_Key": "721895f8-6591-11e9-a79f-525400398225",
        "LineNumber": "1",
        "Преподаватель_Key": "39e6ced7-0541-11e6-80c9-5254005a0b53"
      },
      {
        "Ref_Key": "721895f8-6591-11e9-a79f-525400398225",
        "LineNumber": "2",
        "Преподаватель_Key": "84a6578d-4d0b-11e7-3e82-525400398225"
      }
    ],
    "РасписаниеПреподователя": [],
    "Организация@navigationLinkUrl": "Document_РасписаниеНаДату(guid'721895f8-6591-11e9-a79f-525400398225')/Организация",
    "РасписаниеЗвонков@navigationLinkUrl": "Document_РасписаниеНаДату(guid'721895f8-6591-11e9-a79f-525400398225')/РасписаниеЗвонков",
    "Автор@navigationLinkUrl": "Document_РасписаниеНаДату(guid'721895f8-6591-11e9-a79f-525400398225')/Автор"
  }
];
var shdTemplate =   {
          "selected":null,
          "type":"container",
          "group":"",
          "columns":[[],[],[],[]]
        };

for(var i = 0; i<$scope.tabs1.length;i++){
  for (var j = 0; j < $scope.tabs1[i]['Расписание'].length; j++) {
     shed = $scope.tabs1[i]['Расписание'][j];
     shdTemplate.group = shed['УчебнаяГруппа_Name'];
     shdTemplate.columns[0].push({teacher:shed['Преподаватель_Name'],type:"item",types:"Преподавателя"});
     shdTemplate.columns[1].push({discipline:shed['Дисциплина_Name'],type:"item",types:"Предмет"});
     shdTemplate.columns[2].push({auditorium:shed['Аудитория_Name'],type:"item",types:"Кабинет"});
     shdTemplate.columns[3].push({comment:"нет в 1С",type:"item",types:"Комментарий"});
   

  }
    $scope.tabs1[i].schedule = [];
    $scope.tabs1[i].schedule.push(shdTemplate);
    
}
console.log($scope.tabs1);
	$scope.subject =[];
	if(localStorage.getItem('user')){
		$scope.userNameTitle = localStorage.getItem('user');

	}else{
		$scope.userNameTitle = '';
	}






$scope.subject= listSubject.data.value;
	$scope.disciplines = listDisciplines.data.value;
	$scope.teachers = listTeachers.data.value;
	$scope.logout = function(){
		localStorage.removeItem('token');
		localStorage.removeItem('user');
		$window.location.href= '/#';
	}
	$scope.newTeacher = function(name,list){

		if(name){
			name = name[0].toUpperCase() + name.slice(1);
			$http({
				method:'POST',
				url:'/api/teacher',
				data:{"teacher":name},
				headers: {'Authorization': 'Bearer '+localStorage.getItem('token')}
			}).then(function(response){
				if(response){
					list.push(response.data);
					var autoChild = document.getElementById('teacherAuto').firstElementChild;
					var el = angular.element(autoChild);
					el.scope().$mdAutocompleteCtrl.hidden = true;
				}
			}).catch(function(error){
				if(error.data.message.indexOf('UnauthorizedError') !=-1){
					err = 'Войдите в систему';
				}else{
					err = error.data.message;
				}
				$mdDialog.show(
					$mdDialog.alert()
					.clickOutsideToClose(true)
					.title('Ошибка!')
					.textContent(err)
					.ariaLabel('Left to right demo')
					.ok('Продолжить')
					);

			})
		}
	}
	$scope.showConfirm = function(ev) {
    // Appending dialog to document.body to cover sidenav in docs app
    var confirm = $mdDialog.confirm()
    .title('Would you like to delete your debt?')
    .textContent('All of the banks have agreed to forgive you your debts.')
    .ariaLabel('Lucky day')
    .targetEvent(ev)
    .ok('Please do it!')
    .cancel('Sounds like a scam');

    $mdDialog.show(confirm).then(function() {
    	$scope.status = 'You decided to get rid of your debt.';
    }, function() {
    	$scope.status = 'You decided to keep your debt.';
    });
  };
  $scope.newDiscipline = function(name,list){
   if(name){
    name = name[0].toUpperCase() + name.slice(1);
    $http({
     method:'POST',
     url:'/api/discipline',
     headers: {'Authorization': 'Bearer '+localStorage.getItem('token')},
     data:{"discipline":name}
   }).then(function(response){
     if(response){
      list.push(response.data);
      var autoChild = document.getElementById('disciplineAuto').firstElementChild;
      var el = angular.element(autoChild);
      el.scope().$mdAutocompleteCtrl.hidden = true;
    }
  }).catch(function(error){
   if(error.data.message.indexOf('UnauthorizedError') !=-1){
    err = 'Войдите в систему';
  }else{
    err = error.data.message;
  }
  $mdDialog.show(
    $mdDialog.alert()
    .clickOutsideToClose(true)
    .title('Ошибка!')
    .textContent(err)
    .ariaLabel('Left to right demo')
    .ok('Продолжить')
    );

})
}
}

$scope.removeFromList = function(list, index,ev) {
	
	var name = '';
		   // Appending dialog to document.body to cover sidenav in docs app
		   
		   if(list[index].teacher){
		   	name = list[index].teacher;
		   	var confirm = $mdDialog.confirm()
		   	.title('Удаление')
		   	.textContent('Вы правда хотите удалить преподавателя из списка ?')
		   	.ariaLabel('Удаление')
		   	.targetEvent(ev)
		   	.ok('Удалить')
		   	.cancel('Отменить');

		   	$mdDialog.show(confirm).then(function() {
		   		$http({
		   			method: 'Delete',
		   			url: '/api/teacher/'+name,
		   			headers: {'Authorization': 'Bearer '+localStorage.getItem('token')}
		   		}).then(function (response){
		   			if(response){
		   				list.splice(index, 1);
		   				$mdToast.show(
		   					$mdToast.simple()
		   					.textContent('Преподаватель удален!')
		   					.position('top left')
		   					.hideDelay(2500))
		   				.then(function() {
		   				})
		   			}
		   		},function (error){
		   			
		   			if(error.data.message.indexOf('UnauthorizedError') !=-1){
		   				err = 'Войдите в систему';
		   			}else{
		   				err = error.data.message;
		   			}
		   			$mdDialog.show(
		   				$mdDialog.alert()
		   				.clickOutsideToClose(true)
		   				.title('Ошибка!')
		   				.textContent(err)
		   				.ariaLabel('Left to right demo')
		   				.ok('Продолжить')
		   				);

		   			
		   		});
		   	}, function() {});
		   	
		   }else if(list[index].discipline){
		   	name = list[index].discipline;
		   	var confirm = $mdDialog.confirm()
		   	.title('Удаление')
		   	.textContent('Вы правда хотите удалить предмет из списка ?')
		   	.ariaLabel('Удаление')
		   	.targetEvent(ev)
		   	.ok('Удалить')
		   	.cancel('Отменить');
		   	$mdDialog.show(confirm).then(function() {
		   		$http({
		   			method: 'Delete',
		   			url: '/api/discipline/'+name,
		   			headers: {'Authorization': 'Bearer '+localStorage.getItem('token')}
		   		}).then(function (response){




		   			
		   			if(response){
		   				list.splice(index, 1);
		   				$mdToast.show(
		   					$mdToast.simple()
		   					.textContent('Предмет удален!')
		   					.position('top left')
		   					.hideDelay(2500))
		   				.then(function() {
		   				}).catch(function() {
		   				});
		   			}
		   			


		   		},function (error){
		   			
		   			if(error.data.message.indexOf('UnauthorizedError') !=-1){
		   				err = 'Войдите в систему';
		   			}else{
		   				err = error.data.message;
		   			}
		   			$mdDialog.show(
		   				$mdDialog.alert()
		   				.clickOutsideToClose(true)
		   				.title('Ошибка!')
		   				.textContent(err)
		   				.ariaLabel('Left to right demo')
		   				.ok('Продолжить')
		   				);

		   			
		   		});
		   	}, function() {});
		   }
		   
     }

     $scope.toggleLeft = buildDelayedToggler('left');
     $scope.toggleLeftSec = buildDelayedToggler('leftSec');
     $scope.toggleRight = buildDelayedToggler('right');
     $scope.dragStart = function(ind){
       $scope.draggedFrom = ind.toString()
     }
     $scope.dropCallback = function(index, item, external, list) {
		
      //получаем нужный тип
      typeItem = external[0].types;
      $scope.draggedTo = index.toString()
      $scope.draggedItem = item;
      if(item.types == typeItem){
          console.log("dropsС",index, item, list);
          console.log(list);
          if(list[0]["columns"][1].length ==  list[0]["columns"][2].length && 
             list[0]["columns"][0].length ==  list[0]["columns"][2].length){
             list[0]["columns"][2].push({auditorium: "",type: "item",types: "Кабинет"});
          }
      }
      if(item.types == typeItem){
      	return item;
      }
      else{
      	return false;
      }
      
    };
    $scope.dropCallback1 = function(index, item, external, ind) {
  	console.log("drop1",index, item, external, ind );
  	//console.log("drop1", $scope.lists);
  	$scope.draggedTo = index.toString()
  	$scope.draggedItem = item;
  	return item;
  };
  $scope.dropCallback2 = function(index, item, external, ind) {
  	console.log("drop2",index, item, external, ind );
  	//console.log("drop1", $scope.lists);
  	$scope.draggedTo = index.toString()
  	$scope.draggedItem = item;
  	return item;
  };

  $scope.scrollTo = function (id) {
  	$anchorScroll(id);  
  }
  $scope.putTab = function(item){
  	title = item.title;
  	if(item && title){
  		$http({
  			method: 'PUT',
  			url: '/api/schedule/'+title,
  			headers: {'Authorization': 'Bearer '+localStorage.getItem('token')},
  			data:item.content
  		}).then(function (response){
  			if(response){
  				$mdToast.show(
  					$mdToast.simple()
  					.textContent('Расписание изменено!')
  					.position('top right')
  					.hideDelay(2500))
  				.then(function() {
  				}).catch(function() {
  				});
  			}

  		},function (error){
  			if(error.data.message.indexOf('UnauthorizedError') !=-1){
  				err = 'Войдите в систему';
  			}else{
  				err = error.data.message;
  			}
  			$mdDialog.show(
  				$mdDialog.alert()
  				.clickOutsideToClose(true)
  				.title('Ошибка!')
  				.textContent(err)
  				.ariaLabel('Left to right demo')
  				.ok('Продолжить')
  				);

  		});
  	}


  }
  $scope.selectedTeacher = null;
  $scope.selectedDisciplines = null;
  $scope.selectedTeacher1 = null;
  $scope.isOpenRight = function(){
  	return $mdSidenav('right').isOpen();
  };
  $scope.lengthItemSubj = function(mas){
  	masWrap = mas;
  	if(masWrap === undefined){
  		return 1;
  	}else{
  		if(mas.length ==0){
  			return 1;
  		}else{
  			return 50;
  		}
  	}

  }

  function DialogController($scope, $mdDialog) {
  	$scope.userName= '';
  	$scope.passwordName= '';
  	$scope.statusUser = false;
  	$scope.hide = function() {
  		$mdDialog.hide();
  	};

  	$scope.cancel = function() {
  		$mdDialog.cancel();
  	};

  	$scope.login = function(){
  		
  		if($scope.userName &&  $scope.passwordName){
  			var promise = $http({
  				method: 'POST',
  				url: '/api/login',
  				data:{name:$scope.userName, password:$scope.passwordName}
  			}).then(function (response){
  				localStorage.setItem('token', response.data.token);
  				localStorage.setItem('user',$scope.userName);
  				$mdDialog.hide($scope.userName);
  			},function (error){
  				$scope.statusUser = true;
  			});
  			return promise;
  		}
  	}

  	$scope.answer = function(answer) {
  		$mdDialog.hide(answer);
  	};
  }
  $scope.showPrompt = function(ev) {
  	$mdDialog.show({
  		controller:DialogController,
  		templateUrl: 'dialog1.tmpl.html',
  		parent: angular.element(document.body),
  		targetEvent: ev,
  		clickOutsideToClose:true,
  		fullscreen: $scope.customFullscreen 
  	})
  	.then(function(name) {
  		$scope.userNameTitle = name;
  		$scope.userName = name;
  		$scope.status = 'Вы вошли как "' + name + '".';
  	}, function() {
  		if(!$scope.userNameTitle){
  			$scope.status = 'Вы не вошли в систему!';
  		}
  		
  	});
  };


  var tabs = [
  { title: 'Понедельник', content: {
  	number:'00001',
  	dateReg:'2019-02-08',
  	dateSched:'2019-02-08',
  	schedule:[
  	{
  		'group':'1-ПКС-15-1',
  		'lessons':
  		[
  		{
  			'teacher':'Фруленко Ю.А.',
  			'discipline':'МДК 03.03',
  			'number':'1',
  			'comment':'',
  			'auditorium':'108'
  		},
  		{
  			'teacher':'Слугин В.Г.',
  			'discipline':'МДК 03.02',
  			'number':'2',
  			'comment':'',
  			'auditorium':'155'
  		},
  		{
  			'teacher':'Слугин В.Г.',
  			'discipline':'МДК 03.01',
  			'number':'3',
  			'comment':'практика',
  			'auditorium':'452'
  		},
  		]
  	},
  	{
  		'group':'2-ПКС-15-1',
  		'lessons':
  		[
  		{
  			'teacher':'Огудина А.Н.',
  			'discipline':'МДК 02.02',
  			'number':'1',
  			'comment':'',
  			'auditorium':'161'
  		},
  		{
  			'teacher':'Русинова Е.Г.',
  			'discipline':'псих.общ.и страт.трудоустр.',
  			'number':'2',
  			'comment':'',
  			'auditorium':'313'
  		},
  		{
  			'teacher':'Огудина А.Н.',
  			'discipline':'МДК 02.05',
  			'number':'3',
  			'comment':'практика',
  			'auditorium':'156'
  		}
  		]
  	},
  	{
  		'group':'7-ПКС-15-1',
  		'lessons':
  		[
  		{
  			'teacher':'Огудина А.Н.',
  			'discipline':'МДК 02.02',
  			'number':'1',
  			'comment':'',
  			'auditorium':'161'
  		},
  		{
  			'teacher':'Русинова Е.Г.',
  			'discipline':'псих.общ.и страт.трудоустр.',
  			'number':'2',
  			'comment':'',
  			'auditorium':'313'
  		},
  		{
  			'teacher':'Огудина А.Н.',
  			'discipline':'МДК 02.05',
  			'number':'3',
  			'comment':'практика',
  			'auditorium':'156'
  		}
  		]
  	},
  	{
  		'group':'6-ПКС-15-1',
  		'lessons':
  		[
  		{
  			'teacher':'Огудина А.Н.',
  			'discipline':'МДК 02.02',
  			'number':'1',
  			'comment':'',
  			'auditorium':'161'
  		},
  		{
  			'teacher':'Русинова Е.Г.',
  			'discipline':'псих.общ.и страт.трудоустр.',
  			'number':'2',
  			'comment':'',
  			'auditorium':'313'
  		},
  		{
  			'teacher':'Огудина А.Н.',
  			'discipline':'МДК 02.05',
  			'number':'3',
  			'comment':'практика',
  			'auditorium':'156'
  		}
  		]
  	},
  	{
  		'group':'4-ПКС-15-1',
  		'lessons':
  		[
  		{
  			'teacher':'Огудина А.Н.',
  			'discipline':'МДК 02.02',
  			'number':'1',
  			'comment':'',
  			'auditorium':'161'
  		},
  		{
  			'teacher':'Русинова Е.Г.',
  			'discipline':'псих.общ.и страт.трудоустр.',
  			'number':'2',
  			'comment':'',
  			'auditorium':'313'
  		},
  		{
  			'teacher':'Огудина А.Н.',
  			'discipline':'МДК 02.05',
  			'number':'3',
  			'comment':'практика',
  			'auditorium':'156'
  		},
  		{
  			"type": "container",
  			"id": 1,
  			"columns": [
  			[
  			{
  				"type": "item",
  				"id": "1"
  			},
  			{
  				"type": "item",
  				"id": "2"
  			}
  			],
  			[
  			{
  				"type": "item",
  				"id": "3"
  			}
  			]
  			]
  		},
  		]
  	},
  	{
  		'group':'5-ПКС-15-1',
  		'lessons':
  		[
  		{
  			'teacher':'Огудина А.Н.',
  			'discipline':'МДК 02.02',
  			'number':'1',
  			'comment':'',
  			'auditorium':'161'
  		},
  		{
  			'teacher':'Русинова Е.Г.',
  			'discipline':'псих.общ.и страт.трудоустр.',
  			'number':'2',
  			'comment':'',
  			'auditorium':'313'
  		},
  		{
  			'teacher':'Огудина А.Н.',
  			'discipline':'МДК 02.05',
  			'number':'3',
  			'comment':'практика',
  			'auditorium':'156'
  		}
  		]
  	},
  	{
  		'group':'3-ПКС-15-1',
  		'lessons':
  		[
  		{
  			'teacher':'Огудина А.Н.',
  			'discipline':'МДК 02.02',
  			'number':'1',
  			'comment':'',
  			'auditorium':'161'
  		},
  		{
  			'teacher':'Русинова Е.Г.',
  			'discipline':'псих.общ.и страт.трудоустр.',
  			'number':'2',
  			'comment':'',
  			'auditorium':'313'
  		},
  		{
  			'teacher':'Огудина А.Н.',
  			'discipline':'МДК 02.05',
  			'number':'3',
  			'comment':'практика',
  			'auditorium':'156'
  		}
  		]
  	}
  	]
  }
},
{ title: 'Вторник', content: {
	number:'00001',
	dateReg:'2019-02-08',
	dateSched:'2019-02-08',
	schedule:[
	{
		'group':'1-ПКС-15-1',
		'lessons':
		[
		{
			'teacher':'Фруленко Ю.А.',
			'discipline':'МДК 03.03',
			'number':'1',
			'comment':'',
			'auditorium':'108'
		},
		{
			'teacher':'Слугин В.Г.',
			'discipline':'МДК 03.02',
			'number':'2',
			'comment':'',
			'auditorium':'155'
		},
		{
			'teacher':'Слугин В.Г.',
			'discipline':'МДК 03.01',
			'number':'3',
			'comment':'практика',
			'auditorium':'452'
		}
		]
	},
	{
		'group':'2-ПКС-15-1',
		'lessons':
		[
		{
			'teacher':'Огудина А.Н.',
			'discipline':'МДК 02.02',
			'number':'1',
			'comment':'',
			'auditorium':'161'
		},
		{
			'teacher':'Русинова Е.Г.',
			'discipline':'псих.общ.и страт.трудоустр.',
			'number':'2',
			'comment':'',
			'auditorium':'313'
		},
		{
			'teacher':'Огудина А.Н.',
			'discipline':'МДК 02.05',
			'number':'3',
			'comment':'практика',
			'auditorium':'156'
		}
		]
	},
	{
		'group':'7-ПКС-15-1',
		'lessons':
		[
		{
			'teacher':'Огудина А.Н.',
			'discipline':'МДК 02.02',
			'number':'1',
			'comment':'',
			'auditorium':'161'
		},
		{
			'teacher':'Русинова Е.Г.',
			'discipline':'псих.общ.и страт.трудоустр.',
			'number':'2',
			'comment':'',
			'auditorium':'313'
		},
		{
			'teacher':'Огудина А.Н.',
			'discipline':'МДК 02.05',
			'number':'3',
			'comment':'практика',
			'auditorium':'156'
		}
		]
	},
	{
		'group':'subject6',
		'lessons':
		[
		{
			'teacher':'Огудина А.Н.',
			'discipline':'МДК 02.02',
			'number':'1',
			'comment':'',
			'auditorium':'161'
		},
		{
			'teacher':'Русинова Е.Г.',
			'discipline':'псих.общ.и страт.трудоустр.',
			'number':'2',
			'comment':'',
			'auditorium':'313'
		},
		{
			'teacher':'Огудина А.Н.',
			'discipline':'МДК 02.05',
			'number':'3',
			'comment':'практика',
			'auditorium':'156'
		}
		]
	},
	{
		'group':'4-ПКС-15-1',
		'lessons':
		[
		{
			'teacher':'Огудина А.Н.',
			'discipline':'МДК 02.02',
			'number':'1',
			'comment':'',
			'auditorium':'161'
		},
		{
			'teacher':'Русинова Е.Г.',
			'discipline':'псих.общ.и страт.трудоустр.',
			'number':'2',
			'comment':'',
			'auditorium':'313'
		},
		{
			'teacher':'Огудина А.Н.',
			'discipline':'МДК 02.05',
			'number':'3',
			'comment':'практика',
			'auditorium':'156'
		}
		]
	},
	{
		'group':'5-ПКС-15-1',
		'lessons':
		[
		{
			'teacher':'Огудина А.Н.',
			'discipline':'МДК 02.02',
			'number':'1',
			'comment':'',
			'auditorium':'161'
		},
		{
			'teacher':'Русинова Е.Г.',
			'discipline':'псих.общ.и страт.трудоустр.',
			'number':'2',
			'comment':'',
			'auditorium':'313'
		},
		{
			'teacher':'Огудина А.Н.',
			'discipline':'МДК 02.05',
			'number':'3',
			'comment':'практика',
			'auditorium':'156'
		}
		]
	},
	{
		'group':'3-ПКС-15-1',
		'lessons':
		[
		{
			'teacher':'Огудина А.Н.',
			'discipline':'МДК 02.02',
			'number':'1',
			'comment':'',
			'auditorium':'161'
		},
		{
			'teacher':'Русинова Е.Г.',
			'discipline':'псих.общ.и страт.трудоустр.',
			'number':'2',
			'comment':'',
			'auditorium':'313'
		},
		{
			'teacher':'Огудина А.Н.',
			'discipline':'МДК 02.05',
			'number':'3',
			'comment':'практика',
			'auditorium':'156'
		}
		]
	}
	]
}
},
{ title: 'Среда', content: "You can bind the selected tab via the selected attribute on the md-tabs element."},
{ title: 'Четверг', content: "If you set the selected tab binding to -1, it will leave no tab selected."},
{ title: 'Пятница', content: "If you remove a tab, it will try to select a new one."},
{ title: 'Суббота', content: "There's an ink bar that follows the selected tab, you can turn it off if you want."}
],
selected = null,
previous = null;
$scope.tabs = tabs;
$scope.$watch('schedule', function (model) {
	$scope.modelAsJson = angular.toJson(model, true);
}, true);
$scope.selectedIndex = 0;
$scope.$watch('selectedIndex', function(current, old) {
	previous = selected;
	selected = tabs[current];
	if (old + 1 && (old !== current)) {
		$log.debug('Goodbye ' + previous.title + '!');
		
	};

});
$scope.addTab = function(title, view) {
	view = view || title + " Content View";
	tabs.push({title: title, content: view, disabled: false});
};
$scope.removeTab = function(tab) {
	var index = tabs.indexOf(tab);
	tabs.splice(index, 1);
};

function debounce(func, wait, context) {
	var timer;

	return function debounced() {
		var context = $scope,
		args = Array.prototype.slice.call(arguments);
		$timeout.cancel(timer);
		timer = $timeout(function() {
			timer = undefined;
			func.apply(context, args);
		}, wait || 10);
	};
}


function buildDelayedToggler(navID) {
	return debounce(function() {
		$mdSidenav(navID)
		.toggle()
		.then(function () {
			$log.debug("toggle " + navID + " is done");
		});
	}, 200);
}

$scope.closeRight = function () {
	$mdSidenav('right').close()
	.then(function () {
		$log.debug("close RIGHT is done");
	});
};

$scope.closeleft = function () {
	$mdSidenav('left').close()
	.then(function () {
		$log.debug("close LEFT is done");
	});

};
$scope.closeleftSecond = function () {
	$mdSidenav('leftSec').close()
	.then(function () {
		$log.debug("close LEFT Second is done");
	});

};
})





