(function() {
	function BstrpController() {
		var vm = this;
		vm.searchText = '';
		vm.content  = [
	{
		'name' : 'Препод1',
		'subject' : 
		[
			'Препод1предмет1',
			'Препод1предмет2',
			'Препод1предмет3',
			'Препод1предмет4',
			'Препод1предмет5'
		]
	},
		{
		'name' : 'ДЩдщ',
		'subject' : 
		[
			'ДЩдщпредмет1',
			'ДЩдщпредмет2',
			'ДЩдщпредмет3',
			'ДЩдщпредмет4',
			'ДЩдщпредмет6'
		]
	},
		{
		'name' : 'Я кек',
		'subject' : 
		[
			'Я кекпредмет1',
			'Я кекпредмет2',
			'Я кекпредмет3',
			'Я кекпредмет4',
			'Я кекпредмет5'
		]
	},
		{
		'name' : 'кеке',
		'subject' : 
		[
			'кекепредмет1',
			'кекепредмет2',
			'кекепредмет3',
			'кекепредмет4',
			'кекепредмет5'
		]
	},
		{
		'name' : 'лел',
		'subject' : 
		[
			'лелпредмет1',
			'лелпредмет2',
			'лелпредмет3',
			'лелпредмет4',
			'лелпредмет5'
		]
	}
  ];
	}

	angular.module('myApp')
		.controller('BstrpController', BstrpController);
})();